const Discord = require("discord.js");
const client = new Discord.Client();
var prefix = "#";
client.on('message', message => {
    if (message.content == "#سرعه") {
        var x = ["DreamKing",
"DeathGames",
"زيرو كنج",
"أرض الأحلام",
"ألبرازيل",
"العراق",
"ألمملكة ألعربية ألسعودية",
"القسطنطينية",
"النهاية",
"امازون",
"جافاسكربت",
"سهله مو صعبه",
"طبق رطب مرق بقر",
"متجر",
"شجرة الأوغيري",
"عش العصفور",
"هلا بلخميس",
"الحوت الأزرق",
"بلاد الرافدين",
"كانيكي",
"توكا",
"عادل امام",
"عمرو ذياب",
"عمان",
"مسقط",
"بغداد عاصمة العراق",
"بحبك",
"بكرهك",
"يفاجره",
"جوالات",
"طبخ طبيخ طباخ",
"سائق شاحنه",
"اعرب الجمله",
"إوتوبيس",
 "دولة",
"لا تأكل اكل مكشوف",
"الأمنينوم",
"السلفادور",
"القاهره",
"طبق رطب مرق بقر",
"الاحتيال",
"عيدان خشبية",
"كحل",
"بيت الأرنب",
"منتصف الليل",
"اسرع",
"مزرعه",
"ضوضاء",
"البوتات في تطور",
"إمبابه",
"المشائون",
"أوكرنيا",
"التشيك",
"جيرزي",
"بورتوريكو",
"بيداغوجيا",
"اخلاق",
"مفردات اللغة",
"معرفه القرأه والكتابه",
"عقيدة",
"عمل",
"ساعات",
"مصدر",
"ملكه",
"صفصاف السلال",
"محظيات",
                                
];
        var x2 = ['DreamKing',
        "DeathGames",
        "زيرو كنج",
        "أرض الأحلام",
		"ألبرازيل",
		"العراق",
		"ألمملكة ألعربية ألسعودية",
		"القسطنطينية",
		"النهاية",
		"امازون",
		"جافاسكربت",
		"سهله مو صعبه",
		"طبق رطب مرق بقر",
		"متجر",
		"شجرة الأوغيري",
		"عش العصفور",
		"هلا بلخميس",
		"الحوت الأزرق",
        "بلاد الرافدين",
        "كانيكي",
        "توكا",
        "عادل امام",
        "عمرو ذياب",
        "عمان",
        "مسقط",
        "بغداد عاصمة العراق",
        "بحبك",
         "بكرهك",
        "يفاجره",
          "جوالات",
        "طبخ طبيخ الطباخ",
         "سائق شاحنه",
        "اعرب الجمله",
        "إوتوبيس",
        "دولة",
          "لا تأكل اكل مكشوف",
          "الأمنينوم",
          "السلفادور",
            "القاهره",
            "طبق رطب مرق بقر",
              "الاحتيال",
                "عيدان خشبية",
                "كحل",
                "بيت الأرنب",
                "منتصف الليل",
                "اسرع",
                "مزرعه",
                "ضوضاء",
                "البوتات في تطور",
                "إمبابه",
                "المشائون",
                "أوكرنيا",
                "التشيك",
                "جيرزي",
                "بورتوريكو",
                "بيداغوجيا",
                "اخلاق",
                "مفردات اللغة",
                "معرفه القرأه والكتابه",
                "عقيدة",
                "عمل",
                "ساعات",
                "مصدر",
                "ملكه",
                  "صفصاف السلال",
                "محظيات",
      
                  
		
        
        
        
        
        ];
        
        var x3 = Math.floor(Math.random()*x.length)
        message.channel.send(` اول شخص يكتب :  __**${x[x3]}**__
لديك 15 ثانية للاجابة`).then(msg1=> {
            var r = message.channel.awaitMessages(msg => msg.content == x2[x3], {
                maxMatches : 1,
                time : 15000,
                errors : ['time']
            })
        r.catch(() => {
            return message.channel.send(`:negative_squared_cross_mark: لقد انتهى الوقت ولم يقم أحد بالأجابة بشكل صحيح 
            الإجآبة الصحيحةة هي __**${x2[x3]}**__`)
        })
        
        r.then((collected)=> {
            message.channel.send(`${collected.first().author} لقد قمت بكتابة الكلمة في الوقت المناسب  `);
        })
        })
    }
})

client.on('message', puz => {
    if (puz.content == "#لغز") {
        var x = ["ما هي حاسة الشم عند الثعبان ؟",
"ما هو الشي الذي يكسو الناس و هو عار بدون ملابس ؟",
"ما هو الشي الذي لا يجري و لا يمشي ؟",
"ما هو إسم الشهر الميلادي الذي إذا حذفت أوله , تحول إلى إسم فاكهه ؟",
"ما هو الشي الذي لا يدخل الإ إذا ضرب على رأسه ؟",
"ما هو الشيء الذي اسمه على لونه ؟",
"ما هو الشي الذي كلما زاد نقص ؟",
"ما هي التي تحرق نفسها لتفيد غيرها ؟",
"كله ثقوب و مع ذلك يحفظ الماء ؟",
"ما هو الذي لحمه من الداخل و عظمه من الخارج ؟",
"يستطيع ان يخترق الزجاج من دون كسره .. فما هو ؟",
"شئ نراه ولا نسطيع ان نلمسه اول حروفه شئ يقتل واخر حروفه شئ نشربه ؟",		
"شي أمامك ولن تراه ؟",
"تسمعه وتراه ولا يسمعك ولا يراك ؟",
"كم حرفاً يوجد في الأبجدية ؟",
"من هو الخال الوحيد لأولاد عمتك ؟",
"كلي ثقوب ومع ذلك أحفظ الماء. فمن أكون ؟",
"كلمة من أربعة حروف . . إذا أكل الإنسان نصفها يموت، وإذا أكلها كلها لا يموت . . ماهي؟",
"ما هو الشيء الذي يقرصك . . ولا تراه ؟",
"إذا وضعناه في الثلاجة لا يبرد؟",
"له عين ولا يرى . . ما هو؟",
"طائر يلد . . ولا يبيض . .ما هو؟",
"ما الشيء الذي إذا شلنا الحرف الأول منه طار؟",
"هو ابن الماء . وإذا وضع فيه الماء مات … فماذا يكون ؟",
"من هو الذي ينام مرتديا حذاءه لا يفارقه ؟",
"شيء موجود في السماء إذا أضفت إليه حرفا أصبح في الأرض؟",
"ما هو الشيء الذي يوصلك من بيتك إلى عملك دون أن يتحرك؟",
"تاجر من التجار إذا اقتلعنا عينه طار. فمن هو؟",
"ما هو الشيء الذي ترميه كلما احتجت إليه؟",
"يسير بلا رجلين و لا يدخل إلا بالأذنين ما هو؟",
"من هو الانسان الذي قتل ربع سكان العالم؟",
"من هو الحيوان الذي يحك إذنه بأنفه؟",
"ما هو الشي الذي كلما كثر لدينا غلا و كلما قل رخص؟",
"ما هي التي تأكل و لا تشبع؟",
];
        var x2 = ['اللسان',
		"الابره",
        "الماء",
		"تموز",
		"المسمار",
		"البيضة",
		"العمر",
		"الشمعة",
		"الاسفنج",
		"السلحفاة",
		"الضوء",
    "السماء",
		"المستقبل",
		"التلفزيون",
         	"8",
         	"ابويا",
         	"الاسفنج",
         	"سمسم",
         	"الجوع",
                "الفلفل الحار",
		  "الإبره",
		  "الوطواط",
		  "قطار",
		  "الثلج",
		  "الحصان",
		  "نجم,منجم",
		  "الطريق",
		  "عطار",
		  "شبكه الصيد",
		  "الصوت",
		  "قابيل",
		  "الفيل",
		  "العقل",
      "النار",
        
        ];
        
        var x3 = Math.floor(Math.random()*x.length)
        puz.channel.send(`السؤال هو:  __**${x[x3]}**__
لديك 20 ثانية للاجابة`).then(msg1=> {
            var r = puz.channel.awaitMessages(msg => msg.content == x2[x3], {
                maxMatches : 1,
                time : 20000,
                errors : ['time']
            })
        r.catch(() => {
            return puz.channel.send(`:negative_squared_cross_mark: لقد انتهى الوقت ولم يقم أحد بالأجابة بشكل صحيح 
            `)
        })
        
        r.then((collected)=> {
            puz.channel.send(`${collected.first().author} لقد قمت بحل اللغز في الوقت المناسب  `);
        })
        })
    }
})

client.on('message', fkk => {
    if (fkk.content == "#فكك") {
        var x = ["المتاح للجميع لا يتاح لي",
"خعاخع",
"فيلا",
"بريء",
"بسم الله الرحمن الرحيم",
"الضرورة",
"دنيا",
"صارم",
"مات",
"شعبان شبعان",
"ألعراق",
"مستقبل الحياة",
"استوي",
"وسط",
"مقبرة",
"شمعات الإشعال",
"التحلية",
"شريحة",
"احتفال",
"وجهة نظر",
"موضوع",
"شخص",
"غشاء البكارة",
"نجود",
"تشاور",
"طرق",
"هريرة",
"الموسم",
"يرقة",
"أوروبا",
"شيوعي",
"موضوع",
"نجم الرماية",
"اختار",
"بالغ",
"البتلة نبات",
"مسابقة",
"ملعب الأصابع",
"أمريكا",
"برشلونة",
"كرسي",
"رهينة",
"زجاج",
"آلة",
"فناء",
"أخلاق",
"أسلوب",
"كيمياء",
"حافز",
"المعتقدات",
"قلم رصاص",
"علم",
"حافز",
"الإنسانية",
];
        var x2 = ['ا ل م ت ا ح ل ل ج م ي ع ل ا ي ت ا ح ل ى',
		"خ ع ا خ ع",
        "ف ي ل ا",
		"ب ر ي ء",
		"ب س م ا ل ل ه ا ل ر ح م ن ا ل ر ح ي م",
		"ا ل ض ر و ر ة",
		"د ن ي ا",
		"ص ا ر م",
		"م ا ت",
		"ش ع ب ا ن ش ب ع ا ن",
		"أ ل ع ر ا ق",
    "م س ت ق ب ل ا ل ح ي ا ة",
    "ا س ت و ي ",
        "و س ط",
    "م ق ب ر ة",
    "ش م ع ا ت ا ل إ ش ع ا ل",
      "ا ل ت ح ل ي ة",
                  "ش ر ي ح ة",
                  "ا ح ت ف ا ل",
                  "و ج ه ة ن ظ ر",
                  "م و ض و ع",
                  "ش خ ص",
                  "غ ش ا ء ا ل ب ك ا ر ة",
                  "ن ج و د",
                  "ت ش ا و ر",
                  "ط ر ق",
                  "ه ر ي ر ة",
                  "ا ل م و س م",
                  "ي ر ق ة",
                  "أ و ر و ب ا",
                  "ش ي و ع ي",
                  "م و ض و ع",
                  "ن ج م ا ل ر م ا ية",
                  "ا خ ت ا ر",
                  "ب ا ل غ",
                  "ا ل ب ت ل ة ن ب ا ت",
                  "م س ا ب ق ة",
                  "م ل ع ب ا ل أ ص ا ب ع",
                  "أ م ر ي ك ا",
                  "ب ر ش ل و ن ة",
                  "ك ر س ي",
                  "ر ه ي ن ة",
                  "ز ج ا ج",
                  "ا ل ة",
                  "ف ن ا ء",
                  "أ خ ل أ ق",
                  "أ س ل و ب",
                  "ك ي م ي ا ء",
                  "ح ا ف ز",
                  "ا ل م ع ت ق د ا ت",
                  "ق ل م ر ص ا ص",
                  "ع ل م",
                  "ح ا ف ز",
                  "ا ل إ ن س ا ن ي ة",
        
        
        
        ];
        
        var x3 = Math.floor(Math.random()*x.length)
        fkk.channel.send(`اول شخص يفكك :  __**${x[x3]}**__
لديك 15 ثانية للاجابة`).then(msg1=> {
            var r = fkk.channel.awaitMessages(msg => msg.content == x2[x3], {
                maxMatches : 1,
                time : 15000,
                errors : ['time']
            })
        r.catch(() => {
            return fkk.channel.send(`:negative_squared_cross_mark: لقد انتهى الوقت ولم يقم أحد بالأجابة بشكل صحيح 
            الإجآبة الصحيحةة هي __**${x2[x3]}**__`)
        })
        
        r.then((collected)=> {
            fkk.channel.send(`${collected.first().author} لقد قمت بفكيك الجملة في الوقت المناسب`);
        })
        })
    }
})

///////العواصم////////
client.on('message', country => {
    if (country.content == "#عواصم") {
        var x = ["ماهي عاصمه هولندا؟",
                 "ماهي عاصمه الامارات العربيه المتحده",
                 "ماهي عاصمه قطر؟",
                 "ماهي عاصمه الدوله العربيه السعوديه؟",
                 "ماهي عاصمه العراق؟",
                 "ماهي عاصمه لبنان ؟",
                 "ماهي عاصمه سوريا ؟",
                 "ماهي عاصمه اليمن ؟ ",
                 "ماهي عاصمه الاردن؟",
                 "ماهي عاصمه دوله فلسطين",
                 "ماهي عاصمه دوله الكويت",
                 "ماهي عاصمه عمان",
                 "ماهي عاصمه البحرين؟",////
                 "ماهي عاصمه تونس",
                 "ماهي عاصمه الجزائر؟",
                 "ماهي عاصمه جيبوتي؟",
                 "ماهي عاصمه الموريتانيه",
                 "ماهي عاصمه السودان؟",
                 "ماهي عاصمه المغرب ؟",
                 "ماهي عاصمه ليبيا؟",
                 "ماهي عاصمه مصر",
                 "ماهي عاصمه الصومال",
                 "ماهي عاصمه دوله جزر القمر",
                 

];

 var x2 = [ 'أمستردام',
           'ابو ظبي',
           'الدوحه',
           'الرياض',
           'بغداد',
           'بيروت',
           'دمشق',
           'صنعاء',
           'عمان',
           'القدس',
           'الكويت',
           'مسقط',
           'المنامة',/////
           'تونس',
           'الجزائر',
           'جيبوتي',
           'نواكشوط',
           'الخرطوم',
           'الرباط',
           'طرابلس',
           'القاهره',
           'مقديشو',
           'موروني',
           

  ];

var x3 = Math.floor(Math.random()*x.length)
        country.channel.send(`   __**${x[x3]}**__
لديك 20 ثانية للاجابة`).then(msg1=> {
            var r = country.channel.awaitMessages(msg => msg.content == x2[x3], {
                maxMatches : 1,
                time : 20000,
                errors : ['time']
            })
        r.catch(() => {
            return country.channel.send(`:negative_squared_cross_mark: لقد انتهى الوقت ولم يقم أحد بالأجابة بشكل صحيح 
            `)
        })
        
        r.then((collected)=> {
            country.channel.send(`${collected.first().author} لقد قمت بكتابة الكلمة في الوقت المناسب  `);
        })
        })
    }
})


client.on('message', ask => {
    if (ask.content == "#سؤال") {
        var x = ["ما هي العبادة التي لا يمكن أن يقوم بها أكثر من شخص في وقت واحد ؟؟ ",
                 "أمشي بدون قدمين وأطير بلا جناحين وأبكي بدون عينين فمن أنا ؟",
                 "شيء يُلبس .. نصفه الثاني تـم فما هو ؟",
                 "اسم فاكهة يمكن قراءتها بالعكس ولا يتغير اسمها فما هي ؟",
                 "شيء يوجد فوق البحر وعند القبر وبين الشجر ؟",
                 "متى وقع صلح الحديبية ؟",
                 "متى وقعت مذبحة صبرا وشاتيلا بالميلادي ؟",
                 "الروسي يوري هو أول رائد فضاء فمتى كان ذلك ؟",
                 "ما هي السورة التي تبدأ بقوله تعالى ” يا أيها النبي اتق الله ولا تطع الكافرين والمنافقين إن الله كان عليما حكيما ” ؟",
                 "ما هي السورة التي كانت سببا في إسلام عمر بن الخطاب رضي الله عنه ؟",
                  "ما هي السورة التي تعدل ربع القرآن ؟",
                 "ما هي السورة التي تعدل ثلث القرآن ؟",
                 "ما هي اعظم سورة في القرآن الكريم ؟",
                 "ما هي السورة التي تسمى بالفاضحة ؟",
                 "ما هي السورة التي تقع في نصف القرآن ؟",
                 "ما هي السورة التي تسمى بني إسرائيل ؟",
                 "ما هي السورة التي تسمى القتال ؟",
                 "ما هي السورة التي يطلق عليها عروس القرآن ؟",
                 "ما هي السورة التي يطلق عليها قلب القرآن ؟",
                 "ما هي الشجرة المقصودة في قوله تعالى : وشجرة تخرج من طور سيناء ؟",
                 "ما هي مدينة التلال السبع ؟",
                 "ما هي أكبر جزيرة في البحر المتوسط ؟",
                 "ما هي ثاني دولة في العالم من حيث المساحة هي ؟",
                 "ما هي اصغر دولة في العالم ؟",
                 "ما هي اصغر قارات العالم مساحة ؟",
                 "ما هي المعركة التي سماها المسلمون فتح الفتوح ؟",
                 "ما هي أكثر دول العالم انتاجا للفول السوداني ؟",
                 "ما هي اولى دول العالم انتاجا للموز ؟",
                 "ما هي أول دولة خليجية ظهر فيها البترول سنة 1932 م ؟",
                 "ما هي الدولة العربية التي يمر بها خط الاستواء ؟",
                 "ما هي القراءة التي يقرأ بها أهل الشام ؟",
                 "ما هي اكبر جزر البحر المتوسط هي جزيرة ؟",
                 "ما هي اكبر بحيرة نهرية في العالم ؟",
                 "ما هي الدولة التي تتكون من مجموعة من الجزر تشبه الهلال ؟",
                 "ما هي عملة الصومـال ؟",
                 "ما هي عاصمة بولندا ؟",
                 "ما هي السورة التي تنتهي بقوله تعالى ” واعبد ربك حتى يأتيك اليقين ” ؟",
                 "ما هي السورة التي تقع بين سورتي يوسف وإبراهيم ؟",
                 "ما هو أصل كلمة أطلس التي تطلق على كتاب الخرائط ؟",
                 "ما هو يوم الحج الأكبر؟",
                 "ما هو يوم الحج الأكبر؟",
                 "ما هو الاسم الحقيقي للمتنبي ؟",
                 "ما هو الاسم الذي يطلق على الشاعر الذي عاصر الجاهلية والإسلام؟",
                 "ما هو مقياس سرعة السفن؟",
                 "ما هو الحيوان الذي يُسمى البهنس ؟",
                 "ما هو الحيوان الذي إذا قُطعت إحدى أذرعته تنمو مرة أخرى ؟",
                 "ما هو أول جامع أقيم في مصر ؟",
                 "ما هو اسم غلام خديجة الذي صحب الرسول عليه الصلاة والسلام في تجارته ؟",
                 "ما هو لون الرئتين السليمتين ؟",
                 "ما هو أول بنك قام بالنشاط المصرفي في السعودية عام 1926م ؟",
                 "ما هو اسم بيت الدجاج ؟",          
                 

                 

];

 var x2 = [ 'تقبيل الحجر الأسود',
           "السحاب",
           "خاتم",
           "توت",
           "الهواء",
           "عام 6ه",
           "عام 1982 م",
           "عام 1961م",
           "الأحزاب",
           "سورة طـه",
           "الكافرون",
           "الإخلاص",
           "سورة الفاتحة",
           "سورة التوبة",
           "سورة الكهف",
           "الإسراء",
           "محمد",
           "سورة الرحمن",
           "سورة يس",
           "شجرة الزيتون",
           "روم",
           "جزيرة صقلية",
           "كند",
           "الفاتيكان",
           "استرالي",
           "معركة نهاوند",
           "الهند",
           "الاكوادور",
           "البحرين",
           "الصومال",
           "قراءة حفص عن عاصم",
           "صقلية",
           "بحيرة فكتوري",
           "جزر القمر",
           "الشيلينج",
           "وارسو",
           "النحل",
           "الرعد",
           "يوناني",
           "يوم النحر",
           "خليج المكسيك",
           "أحمد بن الحسين",
           "مخضرم",
           "العقدة",
           "الأسد",
           "نجمة البحر",
           "جامع عمرو بن العاص",
           "ميسرة",
           "وردي",
           "البنك الهولندي",
           "قن",
           "رابغ",
           
           
           
  
           

  ];





var x3 = Math.floor(Math.random()*x.length)
        ask.channel.send(`   __**${x[x3]}**__
لديك 20 ثانية للاجابة`).then(msg1=> {
            var r = ask.channel.awaitMessages(msg => msg.content == x2[x3], {
                maxMatches : 1,
                time : 20000,
                errors : ['time']
            })
        r.catch(() => {
            return ask.channel.send(`:negative_squared_cross_mark: لقد انتهى الوقت ولم يقم أحد بالأجابة بشكل صحيح 
            `)
        })
        
        r.then((collected)=> {
            ask.channel.send(`${collected.first().author} لقد قمت بكتابة الكلمة في الوقت المناسب  `);
        })
        })
    }
})

    
                   


client.on('ready', () => {
   console.log(`----------------`);
      console.log(`Cyhper Script By : DREAM`);
        console.log(`----------------`);
      console.log(`ON ${client.guilds.size} Servers '     Script By : DREAM ' `);
    console.log(`----------------`);
  console.log(`Logged in as ${client.user.tag}!`);
client.user.setGame(`Light Games`,"http://twitch.tv/Light")
client.user.setStatus("dnd")
});



client.login(process.env.BOT_TOKEN);// لا تغير فيها شيء